Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/C13A.tmx
Source language: en_us
Languages: zh_cn

source: Why do films do such a bad job of portraying old people?
zh_cn: 衰老真的有那么可怕吗？

source: The Best Exotic Marigold Hotel is full of the usual cinematic cliches about old people – but at least it, for once, tries to deal with some of the big issues about ageing Golden age ...
zh_cn: 最近上映的电影《最好的玛丽戈德涉外饭店》，讲述几个老牌英国明星所饰演的老人到印度旅游的故事，本身无什新意，充斥着电影工业中耳熟能详的陈词滥调，但至少，它试图引领大家开始思考日趋严重的老龄化问题。

source: We certainly have a problem with ageing.
zh_cn: 人口老龄化始终是一个无法回避的话题。

source: To fend it off, we're prepared to smother ourselves in quacksalvers' unguents, submit to abusive surgery, dye our hair and lie about our age.
zh_cn: 为了尽可能的延缓衰老，人们无所不用其极----把来历不明的油膏涂在脸上；听任整容医师的忽悠一次次的躺在手术台上；染头发以及谎报年龄等。

source: We treat those no longer able to disguise its ravages with embarrassed condescension or worse.
zh_cn: 最后，面对伤痕累累的身体，我们才意识到，在岁月这把杀猪刀面前，任谁也无处遁形。

source: We daren't even call them "old" any more, but must rely on euphemisms like senior or third-ager, as if referring to victims of an unspeakable affliction.
zh_cn: 我们讳言“老”字，仿佛“老人”这个就等同与“病人”，是一件难以接受的无比痛苦的事情，所以宁愿自欺欺人的以“年长者”或是“退休人员”自居.

source: The media are usually accused of helping to shape inconvenient attitudes, and in this case cinema gets its share of the blame.
zh_cn: 对此，媒体难辞其咎，人们指责他们过度夸赞年富力强，宣扬这是年轻人的天下等，这对老年人不公平。 而电影也一再的推波助澜，授人以柄。

source: After all, in pursuit of the teen dollar, it has championed attributes to which only the young can be expected to aspire. Unsurprisingly, the tribunes of elderly people complain that the landscape of the big screen is no country for old men.
zh_cn: 归根结底，电影为了吸引年轻人，扩大票房收入，适时地投其所好，不出所料，这引起了老年人的不满，他们中甚至有人站出来控诉大银幕已经没有老年人的位置了。

source: To some extent, this is unfair.
zh_cn: 在某种程度上，这些指责有失公平。

source: Dumbledore, Gandalf and Obi-Wan Kenobi have dispensed the wisdom of the aged, even though society at large has forgotten it ever existed.
zh_cn: 邓布利多、甘道夫以及欧比王·肯诺比这些老人们，无不向人们证明，岁月除了在他们脸上留下印记，也使他们成熟睿智更胜当年，不是有句话吗---姜是老的辣。

source: The likes of Gran Torino, Million Dollar Baby, Tokyo Story, Fear Eats the Soul, Harold and Maude, The Sunshine Boys, Driving Miss Daisy and The Straight Story have portrayed older characters with both compassion and respect.
zh_cn: 一些广受好评的经典电影，比如《老爷车》、《百万美元宝贝》、《东京物语》、《恐惧吞噬灵魂》、《哈洛与慕德》、《阳光小子》、《为戴茜小姐开车》、《史崔特先生的故事》等，它们所塑造的老人形象，一方面让人唏嘘岁月的无情，另一方面又不由得敬佩老人们的乐天知命。

source: Nonetheless, it has to be admitted that the complainants have a point.
zh_cn: 虽然如此，电影中对老人形象的丑化却也不无道理。

source: Sometimes, as in What Ever Happened to Baby Jane? or Sunset Boulevard, ageing has been treated as a source of horror.
zh_cn: 有时候，老人们之间因积怨太深，太容易相互激怒，相互毁灭，闻者心惊，为什么他们不能心胸开阔一点？ 电影《兰闰惊变》、《日落大道》就是这样的例子，仇恨的种子深植在老人们的心里，一日日成长成参天大树。

source: More often, elderly characters have simply been pushed to the fringes of the action, and, by implication, to the fringes of life.
zh_cn: 通常上了年经的人，做事容易偏激，死钻牛角尖，久而久之，没有人愿意跟他们打交通，他们不得不处于社会的边缘孤立无援。

source: In 2005, two academics assessed different age-groups' prominence in 88 top-grossing films and compared it to their presence in the population.Thirty somethings were heavily over-represented and forty somethings did OK, while fifty somethings were significantly under-represented and the over-60s severely so.
zh_cn: 2005年，有两位学者对88部票房最高的影片中，不同年龄段的角色在人们心目中的形象进行了一次评估，结果显示，三十多岁的人太爱表现了，有些哗众取宠；四十多岁的人表现正常，易于让人接受；五下多岁的人行事稳重，让人叹服，却有些甘居人后不愿抛头露面；六十多岁的人，严苛而务实，不太好相处。

source: Once marginalised and therefore cut down in screen-time, older characters have had to be stereotyped, with often unbecoming results.
zh_cn: 一部电影时长有限，为了迎合主流市场，通常对老人的角色定位都趋于脸谱化和公式化，并且草草结束，失却了故事的连贯性和可看性。

source: There have been a good few kindly old grandmas, but more often the elderly have been shown as ineffectual, grumpy, behind the times, depressed, lonely, slow-witted, sickly, whining, rude, miserly, hard-of-hearing, ugly, interfering, heartless, intransigent, doddering, mentorish, frisky or profane .
zh_cn: 电影中也确实成功的刻画了一些和蔼风趣的老奶奶，但更多的老人给人留下的印象很负面，比如说，他们在电影中可有可无、脾气很坏、与时代脱节、无精打彩、孤寂、反应迟钝、病歪歪的、怨气冲天、粗鲁、吝啬、失聪、丑陋、碍手碍脚的、毫无同情心、倔强、步履蹒跚、自以为是、为老不尊、整天骂骂咧咧等。

source: However, with the coming of our own millennium, cinema determined to do better.
zh_cn: 然而，随着生活水平的提高，人们更注重精神享受，电影也开始着力提升老人们的银幕形象。

source: It was now in pursuit of the increasingly valuable grey dollar, and out to suck up to the old as eagerly as it had sucked up to the young.
zh_cn: 电影院要争取更多的人买票观看，老人们对电影的热情也不容小觑，他们对票房的贡献有和年轻人分庭抗礼的趋势。

source: Recently, Red (short for "retired, extremely dangerous") saw Bruce Willis reassembling a team of ageing black-ops operatives to prevail in cheery mayhem.
zh_cn: 最近，在电影《赤焰战场》（RED是电影中提到的Retired、Extremely、Dangerous三个词的缩写）中，布鲁斯·威利斯劝说昔日的老搭档们重振旗鼓、奋起反抗，成功的从幕后操纵者布下的一个个圈套中脱身。

source: The Expendables brought back action stars from the 1980s to make mincemeat of less venerable bad guys.
zh_cn: 《敢死队》网络了一批上世纪80年代红极一时的动作明星，重新在大银幕上展示拳脚功夫，以暴制暴，彻底击溃了那些罪恶滔天的坏蛋。

source: Unfortunately, such efforts failed to satisfy the nigglers.
zh_cn: 很不幸，电影在这方面所做的努力，人们并不买账。

source: These films, along with those featuring other kinds of improbably hoary hellraisers, were condemned for requiring the old to ape the behaviour of the young. Old people too far gone to manage this, it was suggested, would only be further demeaned.
zh_cn: 这些电影，一味的让老年人像年轻人一样打打杀杀、惩恶扬善，而不去考虑他们风烛残年，头发已经花白，跟年轻人的行事方式是多么的不相适宜。继续下去，只能使老人们的形象更加的不堪。

source: Still, the movies had other tricks up their sleeve.
zh_cn: 虽然如此，老人题材的电影还是可以挖掘出其它的看点。

source: Films such as Iris, Away from Her and The Iron Lady directly addressed the issues posed by infirmity in old age.
zh_cn: 像《艾里斯》、《相对不相识/柳暗花明》、《铁娘子》就直接探讨了疾病给晚年生活带来的震荡。

source: Their spin was heavily sympathetic, but even so they weren't always welcomed.
zh_cn: 相濡以沫大半辈子的两个人，疾病不其然的侵袭，使原本恬淡的生活瞬时发生了翻天覆地的变化，观者无不被打动，掬一把同情的泪。

source: Some argued that they sanitised the conditions they depicted, thereby belittling real-life sufferers' needs. Others made a contrary complaint.
zh_cn: 但这种主题的电影也容易招致非议，有人认为应该减少艺术化的加工，尽可能的还原苦难者的真切感受，也有人持完全相反的看法。

source: Last year saw the publication of The Silvering Screen, by Canadian academic Sally Chivers.
zh_cn: 去年，加拿大的专业学者萨利·奇弗斯的《大银幕》获准出版发行。

source: She objected to films that "rely on illness or disability narratives to convey the social burden of growing old," thereby treating ageing as a disease.
zh_cn: 她反对电影依靠对老人疾病或残疾的渲染来吸引眼球，使人们误以为变老只能是加重社会的负担。 我们不能像对待病人一样对待老人。

source: What cinema ought to be doing, she suggested, is promulgating "the idea that an old person has value that exceeds the value attached to young appearance".
zh_cn: 她认为电影应该宣扬一种积极正面的观念：不能仅凭他们的外表不再年轻就认为老人不能再为社会做贡献了。

source: A big ask, you might have thought. Still, along comes The Best Exotic Marigold Hotel and, boy, does it do its damnedest.
zh_cn: 回到电影《最好的玛丽戈德涉外饭店》吧，你一定会自问，是否能像小伙子那样拼尽全力捍卫自己的爱情和自己的小酒店？

source: Admittedly, its septet of seniors out to find themselves in the east are required to display traditional old-folk foibles, like confusing Wi-Fi and wireless, and distrusting doctors with a different skin colour. Foreign food? "If I can't pronounce it, I don't want to eat it."
zh_cn: 一行七人不远万里，从英伦岛国来到有着截然不同历史文化传统的东方古国印度，显然有些难以适应，他们毫不掩饰自己英式幽默表象下那与生俱来的倨傲，他们无法接受无线网络和无线电这种新奇玩意儿，不接受不同肤色医生的诊断，拒绝享用叫不上名字的印度食物。

source: All the same, they're grappling with big stuff.
zh_cn: 尽管如此，他们没有放弃努力，在陌生的环境中放飞身心、自我救赎。

source: For them, later life means self-realisation, not inconsequence.
zh_cn: 对他们来说，晚年生活意味着重新审视自已的内心，从重重矛盾中杀出一条血路。

source: That's getting your first-ever job, finding love, breaking free from a stagnant marriage or overcoming a lifetime's guilt.
zh_cn: 比如说，做他们从未尝试过的工作，寻找真爱，走出一段死水无澜的婚姻，从长久的负罪感中解脱出来。

source: Their guidance saves the young from making enormous mistakes, and even succeeds in humanising the staff of a call centre.
zh_cn: 在他们的指引帮助下，年轻的小伙子得以避免犯下影响一生的巨大错误，甚至帮助一名呼叫中心的职员回归人性。

source: No one is expected to slaughter terrorists or seduce teenage lovelies.
zh_cn: 人们也不指望他们去屠杀恐怖分子，或者误导青年人误入岐途。

source: Ageing isn't pathologised.
zh_cn: 老龄化并不是一种态度现象。

source: The only sign of debility is one readily operable gammy hip.
zh_cn: 年纪大了，我们要欣然接受身体的各个器官出现的不同程度的衰弱迹象，比如手脚不灵便，步履蹒跚。

source: Death, when it puts in an appearance, is sudden, painless and discreet.
zh_cn: 有时，我们会突然接收到死亡的警示，而后，悄然离世，没有痛苦和措手不及。

source: So Dr Chivers should be happy, if not her adversaries.
zh_cn: 所以，奇弗斯博士应该很欣慰，死亡并没有与她为敌。

source: But does the film endear us to later life?
zh_cn: 那么，电影是否会让人对晚年生活心生向往？

source: Sadly, no.
zh_cn: 很遗憾，并不会！

source: For heart-warming though the action is, it's hopelessly implausible.
zh_cn: 故事的走向趋于温情脉脉，也不乏让人热泪盈眶的情节，却也透着无能为力的绝望。

source: In this world, "I'm lonely," is a successful chat-up line, and a ratty old Hobnob addict can metamorphose into a finance whizz capable of rescuing an ailing business.
zh_cn: 在这个世界上，孤独寂寥最易与人产生共情，即便是完全陌生的两个人，也可以就着这个话题亲切的交谈下去，觥筹交错之际，越聊越深，生活的窘迫、事业的停滞不前都成了佐酒谈资。

source: The sunny Jaipur hotel turns out to enshrine an alternate reality.
zh_cn: 阳光加浦尔酒店为客人提供寄存服务。

source: What ageing means there isn't what it means in the world around us. However much we emulate the positive outlook of its fortunate inhabitants, we're unlikely to be similarly rewarded.
zh_cn: 衰老并没有什么，或者可以向那些乐观的印度老人们汲取生活的智慧，试着接受并不是相同的付出就能得到一样的回报。

source: In non-exotic environments, ageing may indeed endow some with their own Indian summer of leisure, affection and fulfilment.
zh_cn: 在印度的大环境下，老人们普遍安于现状，夏日的安逸闲适仿若神赐，他们乐在其中，别无所求。

source: More can expect to encounter varying degrees of irrelevance, decline, sickness, hardship, regret, abandonment, loss and loneliness.
zh_cn: 诚然，变老的过程中必定伴随着不可避免的横生枝节，比如身体器官各个功能的衰退、疾病的侵蚀、艰难的世事、不能事事尽如人意的遗憾、被遗弃的窘境、失去生活的支撑、孤立无援等。

source: We don't like any of these things: that's why we dread old age.
zh_cn: 这些我们避无可避的事情，或许，才是我们害怕变老的真正原因吧。

source: Films such as The Best Exotic Marigold Hotel can offer us only a brief respite from our fear of what's to come.
zh_cn: 《最好的玛丽戈德涉外饭店》这类电影，能让我们在看电影的过程中，从对变老的担忧中短暂的抽身出来，开怀大笑或是感动落泪。

source: To provide enduring reassurance, cinema would have to decontaminate ageing as we actually know it. Even for the big screen, that may just be too much of a challenge.
zh_cn: 想要让普罗大众从衰老的阴影中彻底解脱，能平静的面对这一自然而然的生命现象，电影还有更长的路要走，还要面临更大的挑战，我们拭目以待！
